---
type: ReferenceableViewUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ReferenceableViewUtils

`Autodesk.Revit.DB.ReferenceableViewUtils` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ChangeReferencedView | 2015 | `public static void ChangeReferencedView ( Document document , ElementId referenceId , ElementId desiredViewId )` |
| Method | GetReferencedViewId | 2015 | `public static ElementId GetReferencedViewId ( Document document , ElementId referenceId )` |